Revit 2027 API
BuiltInFailures.GenericMEPFailures.CapWasAddedWarning Property
 1 cap was added.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CapWasAddedWarning { get; }
Public Shared ReadOnly Property CapWasAddedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CapWasAddedWarning {
	FailureDefinitionId^ get ();
}
static member CapWasAddedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace